In [1]:
import pandas as pd

In [57]:
data={
    'Name': ['ryan','killian','steven','jim'],
    'Age':[25,20,38,45],
    'City':['mandva','bhesan','junagadh','ranpur'],
    'miles':[100,200,26,300]
}
df=pd.DataFrame(data)

In [58]:
df.head(2)

      Name  Age    City  miles
0     ryan   25  mandva    100
1  killian   20  bhesan    200

In [59]:
# df.iloc[rows.columns]
df.iloc[1]

Name     killian
Age           20
City      bhesan
miles        200
Name: 1, dtype: object

In [60]:
df.iloc[[1,2,3]]

      Name  Age      City  miles
1  killian   20    bhesan    200
2   steven   38  junagadh     26
3      jim   45    ranpur    300

In [61]:
df.iloc[[1,2],[0]]

      Name
1  killian
2   steven

In [62]:
# we can pass multiple columns and rows
df.iloc[[1,2],[0,2]]

      Name      City
1  killian    bhesan
2   steven  junagadh

In [63]:
# iloc not include last index value
df.iloc[0:3,0:3]

      Name  Age      City
0     ryan   25    mandva
1  killian   20    bhesan
2   steven   38  junagadh

In [64]:
df.iloc[:,2]

0      mandva
1      bhesan
2    junagadh
3      ranpur
Name: City, dtype: object

In [65]:
df.set_index('Name',inplace=True)

In [66]:
# change index name
df.rename_axis(index={'Name':'first_name'})

            Age      City  miles
first_name
ryan         25    mandva    100
killian      20    bhesan    200
steven       38  junagadh     26
jim          45    ranpur    300

In [67]:
# checking the index values
index_values=df.index.values
index_values

array(['ryan', 'killian', 'steven', 'jim'], dtype=object)

In [68]:
print('david' in index_values)

False

In [69]:
print('killian' in index_values)

True

In [70]:
# get back to original dataframe by using reset_index
# df.reset_index(inplace=True)

In [71]:
df.loc['killian']

Age          20
City     bhesan
miles       200
Name: killian, dtype: object

In [72]:
# in loc end position is included
df.loc['killian','Age':'City']

Age         20
City    bhesan
Name: killian, dtype: object

In [35]:
df.loc[:,'City']

Name
ryan         mandva
killian      bhesan
steven     junagadh
jim          ranpur
Name: City, dtype: object

In [36]:
df.loc[['killian','steven']]

         Age      City  miles
Name
killian   20    bhesan    200
steven    38  junagadh     26

In [37]:
df.loc[['killian','steven'],['City']]

             City
Name
killian    bhesan
steven   junagadh

In [38]:
df.loc[['killian','steven'],['City','miles']]

             City  miles
Name
killian    bhesan    200
steven   junagadh     26

In [73]:
data_races={
    'race':['badwater','barkley marathon','vero beach ultra','forgotten florida'],
    'year':[2020,2021,2020,2021],
    'difficulty':[9.7,9.8,8.1,6.1]
}
df2=pd.DataFrame(data_races)

In [74]:
df2

                race  year  difficulty
0           badwater  2020         9.7
1   barkley marathon  2021         9.8
2   vero beach ultra  2020         8.1
3  forgotten florida  2021         6.1

In [75]:
# multiple index 
df2=df2.set_index(['race','difficulty'])

In [76]:
df2

                              year
race              difficulty
badwater          9.7         2020
barkley marathon  9.8         2021
vero beach ultra  8.1         2020
forgotten florida 6.1         2021